app/views/training_plans/_form.html.erb

            <%= schedule_subform.hidden_field :exercise_names, name: "training_plan[training_schedules][][exercise_names]", id: "exercises-list-names-#{day}", value: @schedule_exercises[day]&.to_s.presence || [] %>
            <% if @training_plan.training_schedules.exists?(week_day: day) %>
---
SELECT "training_schedules"."id" FROM "training_schedules" WHERE "training_schedules"."training_plan_id" = $1 AND "training_schedules"."week_day" = $2  [["training_plan_id", "5fbfbbe8-ae37-40b9-b8e8-9c976aaf6ae7"], ["week_day", 4]]
SELECT 1 AS one FROM "training_schedules" WHERE "training_schedules"."training_plan_id" = $1 AND "training_schedules"."week_day" = $2 LIMIT $3  [["training_plan_id", "60f284de-7716-412c-b848-05eec8ef0bb9"], ["week_day", 0], ["LIMIT", 1]]

                <div class="exercise-card">
                  <%= content_tag(
                    :div,
                    class: ["exercise-name"],
                    data: { day: "#{day}", name: "#{name}", url: "#{Exercise.find_by(name: name).img_url}" }) do %>
---
SELECT "exercises".* FROM "exercises" WHERE "exercises"."name" = $1 LIMIT $2  [["name", "Pull up"], ["LIMIT", 1]]