app/controllers/exercises_controller.rb

  def index
    @exercises = Exercise.all
    @exercises_categories = ExerciseCategory.all
---
SELECT "exercises".* FROM "exercises"
SELECT "exercise_categories".* FROM "exercise_categories"