app/controllers/home_controller.rb

SELECT "exercises".* FROM "exercises"
SELECT "exercise_categories".* FROM "exercise_categories"
INSERT INTO "training_plans" ("description", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["description", nil], ["created_at", "2023-03-29 23:54:52.702294"], ["updated_at", "2023-03-29 23:54:52.702294"]]
SELECT "training_plans".* FROM "training_plans" ORDER BY "training_plans"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT "training_plans".* FROM "training_plans"
SELECT "training_schedules"."id" FROM "training_schedules" WHERE "training_schedules"."training_plan_id" = $1 AND "training_schedules"."week_day" = $2  [["training_plan_id", "5fbfbbe8-ae37-40b9-b8e8-9c976aaf6ae7"], ["week_day", 4]]
---
  def index
    @exercises = Exercise.all
    @exercises_categories = ExerciseCategory.all
    @training_plan = TrainingPlan.last.presence || TrainingPlan.create
    @schedule_exercises = @training_plan&.training_schedules.grouped_by_week_day.presence || []