app/models/training_schedule.rb

  scope :grouped_by_week_day, -> {
    grouped_exercises = []
    order(:week_day).group_by(&:week_day).map{ |key, value| grouped_exercises[key] = value.map{|schedule| schedule.exercise.name } }
---
SELECT "exercises".* FROM "exercises" WHERE "exercises"."id" = $1 LIMIT $2  [["id", "0121a58a-0327-404a-9ea3-17d6949a8592"], ["LIMIT", 1]]